// Обработчик события "ПриИзменении" поля "Цена" в табличной части "Товары".
//
// Параметры:
//   Элемент - ПолеФормы - элемент формы, вызвавший событие изменения
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиТоварыКлиент.ПриИзмененииРеквизитовВТЧКлиент(Объект.Товары, ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры